kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_rtcc.h
#define RTC_TAMPCR_TAMPFLT_SHIFT  (11)        /* Bits 11-12: RTC_TAMPx filter count */
#define RTC_TAMPCR_TAMPFLT_MASK   (3 << RTC_TAMPCR_TAMPFLT_SHIFT)
#define RTC_TAMPCR_TAMPPRCH_SHIFT (13)        /* Bits 13-14: RTC_TAMPx precharge duration */
#define RTC_TAMPCR_TAMPPRCH_MASK  (3 << RTC_TAMPCR_TAMPPRCH_SHIFT)
#  define RTC_TAMPCR_TAMPPRCH_1CYCLE  (0 << RTC_TAMPCR_TAMPPRCH_SHIFT) /* 1 RTCCLK cycle */
#  define RTC_TAMPCR_TAMPPRCH_2CYCLES (1 << RTC_TAMPCR_TAMPPRCH_SHIFT) /* 2 RTCCLK cycles */
#  define RTC_TAMPCR_TAMPPRCH_4CYCLES (2 << RTC_TAMPCR_TAMPPRCH_SHIFT) /* 4 RTCCLK cycles */
#  define RTC_TAMPCR_TAMPPRCH_5CYCLES (3 << RTC_TAMPCR_TAMPPRCH_SHIFT) /* 8 RTCCLK cycles */

#define RTC_TAMPCR_TAMPPUDIS      (1 << 15) /* Bit 15: RTC_TAMPx pull-up disable */
#define RTC_TAMPCR_TAMP1IE        (1 << 16) /* Bit 16:  RTC_TAMP1 interrupt enable */
#define RTC_TAMPCR_TAMP1NOERASE   (1 << 17) /* Bit 17:  RTC_TAMP1 no erase */
#define RTC_TAMPCR_TAMP1MF        (1 << 18) /* Bit 18:  RTC_TAMP1 mask flag */
#define RTC_TAMPCR_TAMP2IE        (1 << 19) /* Bit 19:  RTC_TAMP2 interrupt enable */
#define RTC_TAMPCR_TAMP2NOERASE   (1 << 20) /* Bit 20:  RTC_TAMP2 no erase */
#define RTC_TAMPCR_TAMP2MF        (1 << 21) /* Bit 21:  RTC_TAMP2 mask flag */
#define RTC_TAMPCR_TAMP3IE        (1 << 22) /* Bit 22:  RTC_TAMP3 interrupt enable */
#define RTC_TAMPCR_TAMP3NOERASE   (1 << 23) /* Bit 23:  RTC_TAMP3 no erase */
#define RTC_TAMPCR_TAMP3MF        (1 << 24) /* Bit 24:  RTC_TAMP3 mask flag */

/* RTC alarm A/B sub second register */

#define RTC_ALRMSSR_SS_SHIFT      (0)   /* Bits 0-14: Sub second value */
#define RTC_ALRMSSR_SS_MASK       (0x7fff << RTC_ALRMSSR_SS_SHIFT)
#define RTC_ALRMSSR_MASKSS_SHIFT  (24)  /* Bits 24-27:  Mask the most-significant bits starting at this bit */
#define RTC_ALRMSSR_MASKSS_MASK   (0xf << RTC_ALRMSSR_MASKSS_SHIFT)

/* RTC option register */

#define RTC_OR_ALARMTYPE          (1 << 0)  /* Bit 0:  RTC alarm type on PC13, pushpull/OD */
#define RTC_OR_OUTRMP             (1 << 1)  /* Bit 1:  remap output to PB2 */

#endif /* __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32H5_RTCC_H */
